{
  "architectures": ["GraniteSWAForCausalLM"],
  "model_type": "granite_swa",
  "vocab_size": 49159,
  "hidden_size": 128,
  "intermediate_size": 256,
  "num_hidden_layers": 4,
  "num_attention_heads": 4,
  "num_key_value_heads": 2,
  "head_dim": 32,
  "hidden_act": "silu",
  "max_position_embeddings": 2048,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-05,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "mlp_bias": false,
  "embedding_multiplier": 1.0,
  "logits_scaling": 1.0,
  "residual_multiplier": 1.0,
  "attention_multiplier": 1.0,
  "sliding_window": 128,
  "layer_types": ["full_attention", "sliding_attention", "sliding_attention", "full_attention"],
  "rope_theta": 10000.0,
  "rope_parameters": {"rope_type": "default", "rope_theta": 10000.0},
  "tie_word_embeddings": true,
  "bos_token_id": 0,
  "eos_token_id": 0,
  "pad_token_id": 0,
  "use_cache": true,
  "dtype": "float32"
}
